{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Short Term Rental Listings\n",
    "\n",
    "Using data from [Inside Airbnb](http://insideairbnb.com) we can model this data as a graph in Neo4j using this graph data model:\n",
    "\n",
    "![](http://guides.neo4j.com/listings/file/img/datamodel_full.png)\n",
    "\n",
    "If you haven't already, import the Listings graph by running `:play http://guides.neo4j.com/listings` in Neo4j Browser and running the import queries."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Querying Neo4j from Python\n",
    "\n",
    "![](http://py2neo.org/v3/_static/py2neo-2016.260x152.png)\n",
    "We can use the [Py2neo library](http://py2neo.org/v3/database.html) for interacting with Neo4j using Python. Py2neo supports Cypher, the bolt protocol, and works nicely with many Python data science libraries."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 47,
   "metadata": {
    "collapsed": false
   },
   "outputs": [],
   "source": [
    "# pip install py2neo\n",
    "from py2neo import Graph"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 49,
   "metadata": {
    "collapsed": false
   },
   "outputs": [],
   "source": [
    "# create connection to Neo4j instance\n",
    "graph = Graph()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "('COUNT(a)': 221419)\n"
     ]
    }
   ],
   "source": [
    "result = graph.run(\"MATCH (a) RETURN COUNT(a)\")\n",
    "for r in result:\n",
    "    print(r)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Pandas\n",
    "\n",
    "We can use the popular [pandas](http://pandas.pydata.org/) with Neo4j. To create a DataFrame object from data from Neo4j simply pass the result object of a Cypher query into the DataFrame constructor."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "# pip install pandas\n",
    "from pandas import DataFrame"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 104,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>amenities</th>\n",
       "      <th>name</th>\n",
       "      <th>neighborhood</th>\n",
       "      <th>price</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>[Fire Extinguisher, Carbon Monoxide Detector, ...</td>\n",
       "      <td>Cute One Bedroom Apartment in SoCo</td>\n",
       "      <td>None</td>\n",
       "      <td>100.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>[TV, Kitchen, Free Parking on Premises, Heatin...</td>\n",
       "      <td>Private &amp; quiet; walk to the party</td>\n",
       "      <td>None</td>\n",
       "      <td>650.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>[Internet, Wireless Internet, TV, Cable TV, He...</td>\n",
       "      <td>East Side Hideaway Studio</td>\n",
       "      <td>None</td>\n",
       "      <td>75.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>[Free Parking on Premises, Kitchen, Pool, Air ...</td>\n",
       "      <td>Awesome Space with Great Amenenties</td>\n",
       "      <td>Mueller</td>\n",
       "      <td>200.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>[Essentials, Smoke Detector, Dryer, Washer, He...</td>\n",
       "      <td>1930's Vintage Bungalow off SoCo</td>\n",
       "      <td>None</td>\n",
       "      <td>173.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>[Fire Extinguisher, Essentials, Washer, Smoke ...</td>\n",
       "      <td>Home away from home in South Austin</td>\n",
       "      <td>None</td>\n",
       "      <td>50.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>[Heating, Pets Allowed, Free Parking on Premis...</td>\n",
       "      <td>Great Travis Heights location!</td>\n",
       "      <td>None</td>\n",
       "      <td>129.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>[TV, Internet, Pets Allowed, Indoor Fireplace,...</td>\n",
       "      <td>Gorgeous home 8 min from downtown</td>\n",
       "      <td>Oak Hill</td>\n",
       "      <td>165.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>[Washer, Smoke Detector, Essentials, Shampoo, ...</td>\n",
       "      <td>Private room,private bath + deer!</td>\n",
       "      <td>Northwest Hills</td>\n",
       "      <td>45.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>[Family/Kid Friendly, Essentials, Shampoo, Cab...</td>\n",
       "      <td>St.Eds Secret Casita off S.Congress</td>\n",
       "      <td>None</td>\n",
       "      <td>59.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>[Cable TV, TV, Pool, Air Conditioning, Wireles...</td>\n",
       "      <td>Cozy Apartment on S. Mopac Expy</td>\n",
       "      <td>None</td>\n",
       "      <td>300.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>[Pool, Kitchen, Gym, Elevator in Building, Hea...</td>\n",
       "      <td>Spacious Luxury Apt. 5 min walk ACL</td>\n",
       "      <td>None</td>\n",
       "      <td>480.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>[Heating, First Aid Kit, Essentials, Wireless ...</td>\n",
       "      <td>Safe, clean, and quiet</td>\n",
       "      <td>Northwest Hills</td>\n",
       "      <td>300.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>[First Aid Kit, Carbon Monoxide Detector, Esse...</td>\n",
       "      <td>Private 1 bedroom in Westlake home</td>\n",
       "      <td>Barton Hills</td>\n",
       "      <td>49.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>[TV, Internet, Wireless Internet, Air Conditio...</td>\n",
       "      <td>Queen Bed w/Bath in South Austin</td>\n",
       "      <td>None</td>\n",
       "      <td>70.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>[Smoke Detector, Carbon Monoxide Detector, Fir...</td>\n",
       "      <td>Modern Minimalism</td>\n",
       "      <td>None</td>\n",
       "      <td>390.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>[Shampoo, Essentials, Fire Extinguisher, Inter...</td>\n",
       "      <td>Cozy Apartment with Balconies</td>\n",
       "      <td>None</td>\n",
       "      <td>72.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17</th>\n",
       "      <td>[Other pet(s), Wireless Internet, Internet, Pe...</td>\n",
       "      <td>EZ Camping is in SxSAustin!5</td>\n",
       "      <td>None</td>\n",
       "      <td>14.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18</th>\n",
       "      <td>[Washer, Dryer, Heating, Family/Kid Friendly, ...</td>\n",
       "      <td>78704plex</td>\n",
       "      <td>None</td>\n",
       "      <td>400.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19</th>\n",
       "      <td>[Cable TV, TV, Wireless Internet, Internet, Ki...</td>\n",
       "      <td>SXSW - The Holly House - SXSW</td>\n",
       "      <td>None</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>20</th>\n",
       "      <td>[Heating, Indoor Fireplace, Washer, Family/Kid...</td>\n",
       "      <td>SXSW - Central East Austin Bungalow</td>\n",
       "      <td>None</td>\n",
       "      <td>500.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>21</th>\n",
       "      <td>[Pets live on this property, Breakfast, Heatin...</td>\n",
       "      <td>Fab central Austin home with pool.</td>\n",
       "      <td>None</td>\n",
       "      <td>650.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>22</th>\n",
       "      <td>[Wireless Internet, Air Conditioning, Kitchen,...</td>\n",
       "      <td>Escape to Austin #Zilker #SXSW</td>\n",
       "      <td>None</td>\n",
       "      <td>360.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>23</th>\n",
       "      <td>[Essentials, Smoke Detector, Dryer, Washer, Sh...</td>\n",
       "      <td>Walkable, Charming &amp; Central Home</td>\n",
       "      <td>None</td>\n",
       "      <td>145.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>24</th>\n",
       "      <td>[Kitchen, Free Parking on Premises, Wireless I...</td>\n",
       "      <td>Sunny South Austin condo</td>\n",
       "      <td>None</td>\n",
       "      <td>550.0</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                            amenities  \\\n",
       "0   [Fire Extinguisher, Carbon Monoxide Detector, ...   \n",
       "1   [TV, Kitchen, Free Parking on Premises, Heatin...   \n",
       "2   [Internet, Wireless Internet, TV, Cable TV, He...   \n",
       "3   [Free Parking on Premises, Kitchen, Pool, Air ...   \n",
       "4   [Essentials, Smoke Detector, Dryer, Washer, He...   \n",
       "5   [Fire Extinguisher, Essentials, Washer, Smoke ...   \n",
       "6   [Heating, Pets Allowed, Free Parking on Premis...   \n",
       "7   [TV, Internet, Pets Allowed, Indoor Fireplace,...   \n",
       "8   [Washer, Smoke Detector, Essentials, Shampoo, ...   \n",
       "9   [Family/Kid Friendly, Essentials, Shampoo, Cab...   \n",
       "10  [Cable TV, TV, Pool, Air Conditioning, Wireles...   \n",
       "11  [Pool, Kitchen, Gym, Elevator in Building, Hea...   \n",
       "12  [Heating, First Aid Kit, Essentials, Wireless ...   \n",
       "13  [First Aid Kit, Carbon Monoxide Detector, Esse...   \n",
       "14  [TV, Internet, Wireless Internet, Air Conditio...   \n",
       "15  [Smoke Detector, Carbon Monoxide Detector, Fir...   \n",
       "16  [Shampoo, Essentials, Fire Extinguisher, Inter...   \n",
       "17  [Other pet(s), Wireless Internet, Internet, Pe...   \n",
       "18  [Washer, Dryer, Heating, Family/Kid Friendly, ...   \n",
       "19  [Cable TV, TV, Wireless Internet, Internet, Ki...   \n",
       "20  [Heating, Indoor Fireplace, Washer, Family/Kid...   \n",
       "21  [Pets live on this property, Breakfast, Heatin...   \n",
       "22  [Wireless Internet, Air Conditioning, Kitchen,...   \n",
       "23  [Essentials, Smoke Detector, Dryer, Washer, Sh...   \n",
       "24  [Kitchen, Free Parking on Premises, Wireless I...   \n",
       "\n",
       "                                   name     neighborhood  price  \n",
       "0    Cute One Bedroom Apartment in SoCo             None  100.0  \n",
       "1    Private & quiet; walk to the party             None  650.0  \n",
       "2             East Side Hideaway Studio             None   75.0  \n",
       "3   Awesome Space with Great Amenenties          Mueller  200.0  \n",
       "4      1930's Vintage Bungalow off SoCo             None  173.0  \n",
       "5   Home away from home in South Austin             None   50.0  \n",
       "6        Great Travis Heights location!             None  129.0  \n",
       "7     Gorgeous home 8 min from downtown         Oak Hill  165.0  \n",
       "8     Private room,private bath + deer!  Northwest Hills   45.0  \n",
       "9   St.Eds Secret Casita off S.Congress             None   59.0  \n",
       "10      Cozy Apartment on S. Mopac Expy             None  300.0  \n",
       "11  Spacious Luxury Apt. 5 min walk ACL             None  480.0  \n",
       "12               Safe, clean, and quiet  Northwest Hills  300.0  \n",
       "13   Private 1 bedroom in Westlake home     Barton Hills   49.0  \n",
       "14     Queen Bed w/Bath in South Austin             None   70.0  \n",
       "15                   Modern Minimalism              None  390.0  \n",
       "16        Cozy Apartment with Balconies             None   72.0  \n",
       "17         EZ Camping is in SxSAustin!5             None   14.0  \n",
       "18                            78704plex             None  400.0  \n",
       "19        SXSW - The Holly House - SXSW             None    NaN  \n",
       "20  SXSW - Central East Austin Bungalow             None  500.0  \n",
       "21   Fab central Austin home with pool.             None  650.0  \n",
       "22       Escape to Austin #Zilker #SXSW             None  360.0  \n",
       "23    Walkable, Charming & Central Home             None  145.0  \n",
       "24             Sunny South Austin condo             None  550.0  "
      ]
     },
     "execution_count": 104,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "DataFrame(graph.data(\"MATCH (n:Neighborhood)<-[:IN_NEIGHBORHOOD]-(l:Listing)-[:HAS]->(a:Amenity) RETURN n.name AS neighborhood, l.name AS name, COLLECT(a.name) AS amenities, l.price AS price LIMIT 25\"))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": 62,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>avg_price</th>\n",
       "      <th>neighborhood</th>\n",
       "      <th>zip</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>391.473684</td>\n",
       "      <td>Steiner Ranch</td>\n",
       "      <td>78732</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>316.593939</td>\n",
       "      <td>Barton Hills</td>\n",
       "      <td>78746</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>299.970822</td>\n",
       "      <td>Tarrytown</td>\n",
       "      <td>78703</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>273.533333</td>\n",
       "      <td>None</td>\n",
       "      <td>78725</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>266.297720</td>\n",
       "      <td>St. Edwards</td>\n",
       "      <td>78704</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>265.039370</td>\n",
       "      <td>Govalle</td>\n",
       "      <td>78702</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>258.250000</td>\n",
       "      <td>None</td>\n",
       "      <td>78734</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>257.252427</td>\n",
       "      <td>Rosedale</td>\n",
       "      <td>78731</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>251.645833</td>\n",
       "      <td>Downtown</td>\n",
       "      <td>78701</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>240.000000</td>\n",
       "      <td>None</td>\n",
       "      <td>78735</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "    avg_price   neighborhood    zip\n",
       "0  391.473684  Steiner Ranch  78732\n",
       "1  316.593939   Barton Hills  78746\n",
       "2  299.970822      Tarrytown  78703\n",
       "3  273.533333           None  78725\n",
       "4  266.297720    St. Edwards  78704\n",
       "5  265.039370        Govalle  78702\n",
       "6  258.250000           None  78734\n",
       "7  257.252427       Rosedale  78731\n",
       "8  251.645833       Downtown  78701\n",
       "9  240.000000           None  78735"
      ]
     },
     "execution_count": 62,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# What are the most expensive neighborhoods?\n",
    "avg_zips = DataFrame(graph.data('''\n",
    "MATCH (l:Listing)-[:IN_NEIGHBORHOOD]->(n:Neighborhood)\n",
    "WITH n, avg(l.price) AS avg_price\n",
    "RETURN n.neighborhood_id AS zip, n.name AS neighborhood, avg_price ORDER BY avg_price DESC LIMIT 10\n",
    "'''))\n",
    "\n",
    "avg_zips"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": false
   },
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Plotting\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 58,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "%matplotlib inline"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 64,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<matplotlib.axes._subplots.AxesSubplot at 0x11af2f160>"
      ]
     },
     "execution_count": 64,
     "metadata": {},
     "output_type": "execute_result"
    },
    {
     "data": {
      "image/png": "iVBORw0KGgoAAAANSUhEUgAAAgUAAAHHCAYAAAAvVCsvAAAABHNCSVQICAgIfAhkiAAAAAlwSFlz\nAAAPYQAAD2EBqD+naQAAIABJREFUeJzs3XmcXfP9x/HXzEQiSQ1JtBJipx9JBEEQYqetFlW1llii\nKOUnUkRVS0tb0tr3PVLaovZqUbWmpBGUJPgoQUgkyGI0G8nM74/vucnNzZ2Zeyf3zDkn9/18POaR\nueec+z2fOTkz93O+a01TUxMiIiIitUkHICIiIumgpEBEREQAJQUiIiISUVIgIiIigJICERERiSgp\nEBEREUBJgYiIiESUFIiIiAigpEBEREQiHdr6RjN7BJjh7kOj1wOA64D+wETgJHd/Oe/4w4ELgJ7A\n48Dx7j5zBWIXERGRCmpTTYGZHQbsk/e6C/AI8AywNfAC8IiZdY72bwfcDJwH7AB0A0atSOAiIiJS\nWWUnBWbWDRgJjMvbfBgwz91HeDAM+Bw4ONr/Y+Aud7/T3ScCQ4Bvm9n6Kxa+iIiIVEpbagp+D4wG\n3sjbtj0wpuC4fwGDou93AJ7N7XD3D4Ep0XYRERFJgbKSAjPbA9iZ0DcgXy9gWsG2GUDvEveLiIhI\nwkpOCsysE6Ej4cnuvrBgdxegcNtCoFOJ+0VERCRh5Yw+OB8Y7+5PFNm3gOU/4DsB80rcX5Kmpqam\nmpqact4iIiIiQasfoOUkBYcCa5nZ59HrTgBmdhDwR8JQw3w9gY+i76e2sr8ks2bNpba28klBXV0t\n9fWdaWiYz+LFjRUvP05ZjT2rcUN2Y89q3JDd2LMaN2Q39qzGDfHH3q1b11aPKScp2BVYJe/1SKAJ\nGBHtG1Fw/I7AhdH3Y4HBhA6KmNm6hP4EY8s4P42NTTQ2NpXzlrIsXtzIokXZuolyshp7VuOG7Mae\n1bghu7FnNW7IbuxZjRuSjb3kpMDdP8h/HdUYNLn7ZDP7BPitmV0G3Aj8COgK3BMdfh3wlJmNBcYD\nlwMPu/v7FfgZREREpAIqMs2xu38O7AvsQvjQ3w7Yx93nR/vHAicSJi8aA8wEhlbi3CIiIlIZbZ7m\n2N2PLXg9HtimheNHEzUfiIiISPq0OSlIuy+++IJJkyaUdGxbOnf069efjh07rkiIIiIiqbLSJgWT\nJk3grEvvY7Ue61W87M9nTmHkcBgwoNmKERERkcxZaZMCgNV6rMcaPTdNOgwREZFMqEhHQxEREck+\nJQUiIiICKCkQERGRiJICERERAVbyjoYiIlIZ5QzzrhQN/W5/SgpERKRVcQ7zLmZlHvr9m9/8EoBz\nzjkv4UiWp6RARERKomHelTFs2BlJh9AsJQUiIiLtqEuX1pcwToqSAhERWWm8+up/uPHGa5g0aRI1\nNTUMGLANZ531M374w6M48cQfs88++y459sADv8NJJ53K3nt/i3HjxnLNNZczdeqHbLXV1vTuvS7z\n5s0rqYr/4IP35+CDD+eRRx5i2rQPGTBgG84+++d0796DV155id/85pdsv/2OPPHEoxx11FDee+9d\nYGnzwWOP/Y3Ro29lxozp9O3bl2HDzmSjjUKNzAMP3Mudd45mzpzZ9OnTl2HDzmCjjTaJ4coFGn0g\nIiIrhblz/8cZZ5zG4MGD+fOf7+Wyy67hww8/4I47bmePPfbimWeeXHLsxImv0dDwGTvvvBtTp37I\n2Wf/hL32+ia33fZH+vTpx3333VPWuW+99UaOPPJobrhhFAsWLODcc0cs2Td9+kd8+eUX3Hrrney5\n5zeWed+///0CF110AYceegR33nk3/fr144wzhrFo0SLGjHmWUaNuZvjwMxk16o9sueUATjvtZP73\nv/+t2IVqgZICERFZKSxcuJChQ4/n5JNPpmfPXmy++RbsuusevPfeZPbc85uMG/dv5s+fD8DTTz/J\noEGDWXXVVfnrXx+kb99+DBlyLOuuux7HHXci/fptXta59933u+y997fYaKON+elPf8GECa/y7ruT\nAaipqeHII49h7bXXYa21ei7zvoceuo+99/4W++//PdZZpzcjRoxg772/SUPDZ/zpT39gyJBjGTRo\nMOus05vjjjuRr31tLR577G+VuWBFqPlARERWCt279+Db396XUaNG8eqrE5g8eTJvv/0WW2yxFf36\nbU6PHmvy/PNj2HPPvXnmmac45ZTTAHjnnbfp06ffMmX17dufzz9vKPnc/ftvseT7Xr3Wpr6+nvff\nf5fVV18DgJ49exV935Qp73PAAQcteb3KKqtw6qnDWLSokffff5frrruS66+/esn+L7/8gg8+mFJy\nXOVSUiAiIiuFTz/9hB/+cAj9+/dnwICB7LvvATz//Bhef30iwJImhN691+Wzz+YwaNBgAOrq6mhq\naioorfB1y+rqlv04Xby4kZqapZXxq6yyStH3dejQ/MfwokWLOe20M9h6622X2d6161fKiq0caj4Q\nEZGVwjPPPMXqq6/B9ddfzyGHHMYWW2zF1KkfLvnA32uvbzBu3As8/fQ/GTx4lyUTI2244Ua4v7FM\nWe5vlnXut99+a8n3H374AfPmzWWTTVofvtm793q8/fZ/l7xubGzkwAP3Y+LE11hvvfX5+OMZrLNO\n7yVft99+S6yTSKmmQERESvL5zPiqrYufa9tWj8u3+uqrM336dF544QXq63vw+OOP8eyzTy1pGth0\nU6NHjzW57767+cUvLlzyvv33P5A///lO7rzzdnbZZXeeeuoJXn31FdZZp3fJ577nnj+xySZfp2fP\nXlx++e8YOHAH1lmnNx9/PKPF9x100KEMH34KW2yxJQMGDOCaa/5CU1MTX//6Zhx66BFcfPGF9O69\nLptvvgUPPngfTz31T44++riyrks5lBSIiEir+vXrz8jh7XnGbenXr39Z79hjj72ZMOE/DBs2jKYm\n2GyzvpxyyunccssNLFq0iA4dOrDnnt/gL3+5i+23H7TkfT179uTCCy/mqqsu5ZZbbmTgwO3Yeefd\nmq3yL2afffbjhhuuZsaMGey442DOOOOnJb1vyy0H8JOfnM2oUTdz6aUz6d+/P5dccgUdO3Zkzz33\nZs6cWdx88w3Mnj2TDTfciJEjLysrWSlXzfLtKOn1ySeflxzsK6+8xAW3j49l9q050//Lz4/eNhXT\nb3boUEu3bl2ZPXsuixY1Jh1OybIaN2Q39qzGDdmNPatxQ3Zjb0vckye/w+LFi9h0U1uy7ayzhtGn\nTz+OPfb4Vt9/8MH7M3ToCcvMgdAWcV/zr351tZrWjlGfAhERqWrTpn3IsGEn8+KL/2b69Ok8/PAD\nvPTSi+y66+5Jh9bu1HwgIiJVbfDgXTnssCO56KILmDNnNuuttz6/+tVFbLTRJpxzzpm8+OK/i76v\npqYmaiZo9QE8M5QUiIhI1Rsy5FiGDDl2ue1nnHH2kgmPiunevQff+Ma34gytXSkpEBERaUb37j2S\nDqFdqU+BiIiIAEoKREREJKKkQERERIA29Ckws42Ba4CdgJnA1e7++2jfFcCphEmja6J/T3X3a6P9\nhwMXAD2Bx4Hj3X1mBX4OERERWUFl1RSYWQ3wCDAD2Ar4EXCumR0WHdIHGAH0Inzw9wJujd67HXAz\ncB6wA9ANGLXCP4GIiIhURLk1BWsBrwAnu/tc4B0z+ycwGPgzISkY6e4fF3nvj4G73P1OADMbArxv\nZuu7+/tt/glERESkIsqqKXD36e5+eJQQYGY7AbsAT5nZasA6wFvNvH0H4Nm8sj4EpkTbRUREJGFt\n7mhoZu8RPuSfB+4D+hL6EJxrZh+Y2X/M7Ki8t/QCphUUMwOIb2UHERERKdmKTF50IKHfwPXA5cBL\nQCPwOnAlsBtwo5l95u4PAl2AhQVlLAQ6lXrC2toaamtLm06yri7egRV1dbV06JD84I3czxn3z1tp\nWY0bsht7VuOG7Mae1bghu7FnNW5IR+xtTgrc/WUAMzsduAOoBx5y9znRIRPN7OvAScCDwAKWTwA6\nAfNKPWf37l2pqSktKaiv71xqsW1SX9+Zbt26xnqOcsT988Ylq3FDdmPPatyQ3dizGjdkN/asxg3J\nxl5WUmBmXwMGRU/+Oa8DHYHV3H1WwVveAHLLTE0l1Czk6wl8VOr5Z82aW3JNQUND83NVV0JDw3xm\nz54b6zlKUVdXS319Zxoa5rN4cXaWN81q3JDd2LMaN2Q39qzGDdmNPatxQ/yxl/IgW25NwYbAfWa2\njrtPj7ZtC3wCnGZmO7r73nnHDwDejL4fSxilMBrAzNYl9CcYW+rJGxubaGxsKunYuG+GxYsbU7XG\neNriKVVW44bsxp7VuCG7sWc1bshu7FmNG5KNvdyk4EVgPHCbmQ0nJAkXAxcSPtzPjrY/AHwTOJLQ\ntwDgOsIohbFRGZcDD2s4ooiISDqUOySxEfguMJcw6uBG4Ap3v9rdxwMHAUcBE4BTgMPdfVz03rHA\niYTJi8YQZkMcWqGfQ0RERFZQ2R0No2aDg5rZ9zDwcAvvHU3UfCAiIiLpkr0xGyIiIhILJQUiIiIC\nKCkQERGRiJICERERAZQUiIiISERJgYiIiABKCkRERCSipEBEREQAJQUiIiISUVIgIiIigJICERER\niSgpEBEREUBJgYiIiESUFIiIiAigpEBEREQiSgpEREQEUFIgIiIiESUFIiIiAigpEBERkUiHpAOQ\nZX3xxRdMmjSh5OPr6mqpr+9MQ8N8Fi9ubPX4fv3607FjxxUJUUREVlJKClJm0qQJnHXpfazWY72K\nl/35zCmMHA4DBmxT8bJFRCT7lBSk0Go91mONnpsmHYaIiFQZ9SkQERERQEmBiIiIRJQUiIiICKCk\nQERERCJldzQ0s42Ba4CdgJnA1e7++2jfBsBNwCDgPeB0d/9H3nv3Ai4DNgJeAI5393dX7EcQERGR\nSiirpsDMaoBHgBnAVsCPgHPN7LDokAeBacA2wB3A/WbWO3rvusD9wC3AtsCnwAMV+BlERESkAspt\nPlgLeAU42d3fcfdHgX8Cg81sd2BD4EQPLiLUBgyN3ns88KK7X+7ubwDHAhuY2S4V+UlERERkhZTV\nfODu04HDc6/NbCdgZ+BkYAfgZXdfkPeWMYSmBIDtgWfzyppvZi9H+59FREREEtXmjoZm9h7hw/wF\n4D6gF6HpIN8MoHf0fWv7RUREJEErMvrgQGA/Qt+Cy4AuwMKCYxYCnaLvW9svIiIiCWrzNMfu/jKA\nmQ0H7iR0IOxWcFgnYF70/QKWTwA6AbNLPWdtbQ21tTUlHVtXF+9oy7q6Wjp0qPw5sho3hMWcJk4s\nbTGn2toavvKVVfnf/xbQ2NhU0ns23zwdiznl/o/i/r+qtKzGDdmNPatxQ3Zjz2rckI7Yy0oKzOxr\nwCB3fzBv8+tAR+AjoE/BW3pG2wGmRq8L979S6vm7d+9KTU1pSUF9fedSi22T+vrOdOvWNZZy4xRX\n3AAvvvg6P/ndX2JbzOmmCzozcODAipfdVnH/X8Ulq3FDdmPPatyQ3dizGjckG3u5NQUbAveZ2TpR\np0MIwws/JnQqPNPMOrl7rplgMPBc9P3Y6DUAZtYFGACcV+rJZ82aW3JNQUPD/FKLbZOGhvnMnj03\nlnLjFFfcubLjXMwpztjLUe5y1WmR1bghu7FnNW7IbuxZjRvij72UB8Jyk4IXgfHAbVGzwYbAxcCF\nhE6HHwCjzOwCYH9gIHBM9N5bgTPM7Czgr4Rk4B13f6bUkzc2NpVc1Rz3zbB4cSOLFlX+HFmNO1d2\nnOKMvS3SFk+psho3ZDf2rMYN2Y09q3FDsrGX1XDh7o3Ad4G5wPPAjcAV7n51tG9/QpPAeOAHwAHu\n/mH03vcJnROHAuOANYDvVejnEBERkRVUdkfDqNngoGb2TQZ2b+G9jwGblXtOERERiV/2umeKiIhI\nLJQUiIiICKCkQERERCJKCkRERARQUiAiIiIRJQUiIiICKCkQERGRiJICERERAZQUiIiISERJgYiI\niABKCkRERCSipEBEREQAJQUiIiISUVIgIiIiQBuWThZZ2XzxxRdMmjSh5OPr6mqpr+9MQ8N8Fi9u\nbPX4fv3607FjxxUJUUSkXSgpkKo3adIEzrr0PlbrsV7Fy/585hRGDocBA7apeNkiIpWmpEAEWK3H\neqzRc9OkwxARSZT6FIiIiAigpEBEREQiSgpEREQEUJ8CkUwrZ+REuaMmQCMnRKqNkgKRDMvqyAkN\nAxVJJyUFIhmXxZETWU1mRFZ2SgpEJBFZTGZEVnbqaCgiIiKAkgIRERGJqPlARKQMGvEhK7OykwIz\nWxu4EtgdmAfcDfzU3b8wsyuAU4EmoCb691R3vzZ67+HABUBP4HHgeHefWYkfRESkPWS1k6RGfEgp\n2lJTcC8wE9gJ6AHcBiwCRgB9on9vzzu+AcDMtgNuBk4AXgWuAkYB+7UtdBGRZGSxk2RWkxlpX2Ul\nBWZmwHbAWu7+abTtF8DvWJoUjHT3j4u8/cfAXe5+Z/S+IcD7Zra+u7+/Aj+DiIiUIIvJjLSvcjsa\nTgf2ySUEkRqgk5mtBqwDvNXMe3cAns29cPcPgSnRdhEREUlYWTUF7v4ZoS8AAGZWQ6gBeJZQS9AE\nnGtm+xCaGC5199HR4b2AaQVFzgB6ty10ERGpBurc2X5WdPTB74ABwEBgW6AReJ3QEXE34EYz+8zd\nHwS6AAsL3r8Q6FTqyWpra6itrSnp2Lq6eEdb1tXV0qFD5c+R1bhzZcdJ17x42XHSNS9edpx0zZf3\n2muTYu0PccmZtWy9dfL9IXL/R3H/X7WkzUmBmV0M/B9wiLu/DrxuZg+5+5zokIlm9nXgJOBBYAHL\nJwCdCCMYStK9e1dqakpLCurrO5dabJvU13emW7eusZQbp7jizpUdJ13z4mXHSde8eNlx0jUvXnac\n/SHijL0t4v6/akmbkgIzuwo4ETjC3R/Ibc9LCHLeIAxdBJhKGIqYryfwUannnTVrbsk1BQ0N80st\ntk0aGuYze/bcWMqNU1xx58qOk6558bLjpGtevOw46ZoXLztOccZejrY0fZSjlMSnLfMUnEcYVnio\nu9+ft/2XwI7uvnfe4QOAN6PvxwKDgdHR8esS+hOMLfXcjY1NNDY2lXRsHBe0sPxFiyp/jqzGnSs7\nTrrmxcuOk6558bLjpGtevOw4xRl7WyQZT7lDEvsA5wK/AZ43s7Xydj8MnG1mw4EHgG8CRxL6FgBc\nBzxlZmOB8cDlwMMajigiIpIO5fZm2D96z7mEkQTTCNX/09x9PHAQcBQwATgFONzdxwG4+1hCk8N5\nwBjC6IShFfgZREREpALKHZJ4MXBxC/sfJtQYNLd/NFHzgYiIiKSLVkkUERERQKskioiIxCKLi1Ap\nKRAREYlBFhehUlIgIiISk6wtQqU+BSIiIgIoKRAREZGIkgIREREBlBSIiIhIREmBiIiIAEoKRERE\nJKKkQERERAAlBSIiIhJRUiAiIiKAkgIRERGJKCkQERERQEmBiIiIRJQUiIiICKCkQERERCJKCkRE\nRARQUiAiIiIRJQUiIiICKCkQERGRiJICERERAZQUiIiISERJgYiIiABKCkRERCSipEBEREQA6FDO\nwWa2NnAlsDswD7gb+Km7f2FmGwA3AYOA94DT3f0fee/dC7gM2Ah4ATje3d+twM8gIiIiFVBuTcG9\nwKrATsBhwH7ABdG+B4FpwDbAHcD9ZtYbwMzWBe4HbgG2BT4FHljR4EVERKRySk4KzMyA7YBj3P1N\nd/8X8AvgB2a2O7AhcKIHFxFqA4ZGbz8eeNHdL3f3N4BjgQ3MbJdK/jAiIiLSduXUFEwH9nH3Twu2\ndwJ2AF529wV528cQmhIAtgeeze1w9/nAy3n7RUREJGEl9ylw98+Ax3OvzawGOAV4DuhFaDrINwPo\nHX3f2n4RERFJWFkdDQv8DhgADASGAwsL9i8k1CIAdGllf0lqa2uora0p6di6ungHVtTV1dKhQ+XP\nkdW4c2XHSde8eNlx0jUvXnacdM2Llx0nXfOl2pQUmNnFwP8Bh7j762a2AOhecFgnwggFgAUsnwB0\nAmaXc97u3btSU1NaUlBf37mcostWX9+Zbt26xlJunOKKO1d2nHTNi5cdJ13z4mXHSde8eNlx0jVf\nquykwMyuAk4EjnD33AiCqUDfgkN7Ah/l7e9ZZP8r5Zx71qy5JdcUNDTML6fosjU0zGf27LmxlBun\nuOLOlR0nXfPiZcdJ17x42XHSNS9edpyq5ZqXkkCUO0/BecAJwKHufn/errHACDPr5O65ZoLBhP4G\nuf2D88rpQmh6OK+c8zc2NtHY2FTSsYsXN5ZTdNkWL25k0aLKnyOrcefKjpOuefGy46RrXrzsOOma\nFy87TrrmS5WcFJhZH+Bc4DfA82a2Vt7uZ4APgFFmdgGwP6GvwTHR/luBM8zsLOCvhGTgHXd/ZoV/\nAhEREamIcnoo7B8dfy5hJME0QvPANHdvBA4gNAmMB34AHODuHwK4+/vAgYR5C8YBawDfq9DPICIi\nIhVQzpDEi4GLW9j/DmH64+b2PwZsVlZ0IiIi0m60IJKIiIgASgpEREQkoqRAREREACUFIiIiElFS\nICIiIoCSAhEREYkoKRARERFASYGIiIhElBSIiIgIoKRAREREIkoKREREBFBSICIiIhElBSIiIgIo\nKRAREZGIkgIREREBlBSIiIhIREmBiIiIAEoKREREJKKkQERERAAlBSIiIhJRUiAiIiKAkgIRERGJ\nKCkQERERQEmBiIiIRJQUiIiICKCkQERERCJKCkRERASADm19o5l1AsYDP3b3Z6NtVwCnAk1ATfTv\nqe5+bbT/cOACoCfwOHC8u89coZ9AREREKqJNNQVRQvAnoG/Brj7ACKAX4YO/F3Br9J7tgJuB84Ad\ngG7AqLacX0RERCqv7JoCM+sD/LGZ3X2Ake7+cZF9Pwbucvc7o3KGAO+b2fru/n65cYiIiEhltaWm\nYGfgUWAQoYkAADNbDVgHeKuZ9+0APJt74e4fAlOi7SIiIpKwsmsK3P3G3Pdmlr+rD6EPwblmtg8w\nE7jU3UdH+3sB0wqKmwH0LjcGERERqbw2dzQsYjOgEXgduBLYDbjRzD5z9weBLsDCgvcsBDqVeoLa\n2hpqa2taPxCoq4t3YEVdXS0dOlT+HFmNO1d2nHTNi5cdJ13z4mXHSde8eNlx0jVfqmJJgbuPNrOH\n3H1OtGmimX0dOAl4EFjA8glAJ2Beqefo3r0rNTWlJQX19Z1LLbZN6us7061b11jKjVNccefKjpOu\nefGy46RrXrzsOOmaFy87TrrmS1WypoC8hCDnDWD36PuphBEJ+XoCH5Va/qxZc0uuKWhomF9qsW3S\n0DCf2bPnxlJunOKKO1d2nHTNi5cdJ13z4mXHSde8eNlxqpZrXkoCUbGkwMx+Cezo7nvnbR4AvBl9\nPxYYDIyOjl+X0J9gbKnnaGxsorGxqaRjFy9uLLXYNlm8uJFFiyp/jqzGnSs7TrrmxcuOk6558bLj\npGtevOw46ZovVcmagoeBs81sOPAA8E3gSELfAoDrgKfMbCxh0qPLgYc1HFFERCQdVrSHwpLHdncf\nDxwEHAVMAE4BDnf3cdH+scCJhMmLxhBGJwxdwfOLiIhIhaxQTYG71xW8fphQY9Dc8aOJmg9EREQk\nXbQgkoiIiABKCkRERCSipEBEREQAJQUiIiISUVIgIiIigJICERERiSgpEBEREUBJgYiIiESUFIiI\niAigpEBEREQiSgpEREQEUFIgIiIiESUFIiIiAigpEBERkYiSAhEREQGUFIiIiEhESYGIiIgASgpE\nREQkoqRAREREACUFIiIiElFSICIiIoCSAhEREYkoKRARERFASYGIiIhElBSIiIgIoKRAREREIh3a\n+kYz6wSMB37s7s9G2zYAbgIGAe8Bp7v7P/LesxdwGbAR8AJwvLu/29YYREREpHLaVFMQJQR/AvoW\n7HoAmAZsA9wB3G9mvaP3rAvcD9wCbAt8Gh0vIiIiKVB2UmBmfYCxwIYF2/cg1ACc6MFFhNqAodEh\nxwMvuvvl7v4GcCywgZntsiI/gIiIiFRGW2oKdgYeJTQR1ORt3x542d0X5G0bEx2X2/9sboe7zwde\nztsvIiIiCSq7T4G735j73szyd/UiNB3kmwH0LnG/iIiIJKiSow+6AAsLti0EOpW4X0RERBLU5tEH\nRSwAuhds6wTMy9tfmAB0AmaXeoLa2hpqa2taPxCoq4t3tGVdXS0dOlT+HFmNO1d2nHTNi5cdJ13z\n4mXHSde8eNlx0jVfqpJJwVSWH43QE/gob3/PIvtfKfUE3bt3paamtKSgvr5zqcW2SX19Z7p16xpL\nuXGKK+5c2XHSNS9edpx0zYuXHSdd8+Jlx0nXfKlKJgVjgRFm1sndc80Eg4Hn8vYPzh1sZl2AAcB5\npZ5g1qy5JdcUNDTML7XYNmlomM/s2XNjKTdOccWdKztOuubFy46TrnnxsuOka1687DhVyzUvJYGo\nZFLwDPABMMrMLgD2BwYCx0T7bwXOMLOzgL8SkoF33P2ZUk/Q2NhEY2NTSccuXtxYeuRtsHhxI4sW\nVf4cWY07V3acdM2Llx0nXfPiZcdJ17x42XHSNV9qRRsjlnxCu3sj8F1Ck8B44AfAAe7+YbT/feBA\nwrwF44A1gO+t4PlFRESkQlaopsDd6wpeTwZ2b+H4x4DNVuScIiIiEg8tiCQiIiKAkgIRERGJKCkQ\nERERQEmBiIiIRJQUiIiICKCkQERERCJKCkRERARQUiAiIiIRJQUiIiICKCkQERGRiJICERERAZQU\niIiISERJgYiIiABKCkRERCSipEBEREQAJQUiIiISUVIgIiIigJICERERiSgpEBEREUBJgYiIiESU\nFIiIiAigpEBEREQiSgpEREQEUFIgIiIiESUFIiIiAigpEBERkYiSAhEREQGgQyULM7MDgPuAJqAm\n+vdedz/EzAYA1wH9gYnASe7+ciXPLyIiIm1X6ZqCvsBDQM/oqxfwQzPrAjwCPANsDbwAPGJmnSt8\nfhEREWmjitYUAH2Aie7+Sf5GMxsKzHP3EdGmYWb2beBgYHSFYxAREZE2iKOm4K0i27cHxhRs+xcw\nqMLnFxEU6x/NAAAgAElEQVQRkTaqdE2BAd8ys58BdcDdwHmEZoSJBcfOAPpV+PwiIiLSRhVLCsxs\nPaAzMJ/QLLAhcCXQJfpaWPCWhUCncs5RW1tDbW1NScfW1cU7sKKurpYOHSp/jqzGnSs7TrrmxcuO\nk6558bLjpGtevOw46ZovVbGkwN2nmFkPd58TbXrNzOqAO4CnWD4B6ATMK+cc3bt3paamtKSgvj7e\nPoz19Z3p1q1rLOXGKa64c2XHSde8eNlx0jUvXnacdM2Llx0nXfOlKtp8kJcQ5LwBrApMJ4xGyNcT\n+Kic8mfNmltyTUFDw/xyii5bQ8N8Zs+eG0u5cYor7lzZcdI1L152nHTNi5cdJ13z4mXHqVqueSkJ\nRCWbD74B/BHo7e4Los0DgE+B54CfFrxlR+DX5ZyjsbGJxsamko5dvLixnKLLtnhxI4sWVf4cWY07\nV3acdM2Llx0nXfPiZcdJ17x42XHSNV+qkjUFzxOaA242s18BGwMjgYuBe4GLzewy4EbgR0BXQkdE\nERERSYGK9VBw9/8B3wS+CrwI3ARc7+6XuPvnwHeAXYDxwHbAPu4eb92KiIiIlKzSfQreICQGxfaN\nB7ap5PlERESkcrQgkoiIiABKCkRERCSipEBEREQAJQUiIiISUVIgIiIigJICERERiSgpEBEREUBJ\ngYiIiESUFIiIiAigpEBEREQiSgpEREQEUFIgIiIiESUFIiIiAigpEBERkYiSAhEREQGUFIiIiEhE\nSYGIiIgASgpEREQkoqRAREREACUFIiIiElFSICIiIoCSAhEREYkoKRARERFASYGIiIhElBSIiIgI\noKRAREREIkoKREREBIAO7XkyM+sEXAscCMwDLnH3S9szBhERESmuvWsKfg9sDewGnAycZ2YHtnMM\nIiIiUkS7JQVm1gU4Dvg/d3/V3R8ERgKntFcMIiIi0rz2rCnYktBc8ULetjHA9u0Yg4iIiDSjPZOC\nXsCn7r4ob9sMYFUz69GOcYiIiEgR7dnRsAuwsGBb7nWnUgqora2htrampJPV1dXy+cwppUdXhs9n\nTqGubjs6dKh8TpXVuCG7sWc1bshu7FmNG7Ibe1bjhuzGnsW4a5qamipaYHPM7CDgSndfO2/bZsAk\noIe7z2mXQERERKSo9mw+mAqsaWb55+wJzFdCICIikrz2TAr+A3wJ7JC3bWfgxXaMQURERJrRbs0H\nAGZ2HbATMBToDYwCjnH3B9otCBERESmqXWc0BIYTZjR8EvgM+LkSAhERkXRo15oCERERSS8tiCQi\nIiKAkgIRERGJKCkQERERQEmBiIiIRJQUiIiICKCkQERERCLtPU9BapjZasBmwKrAMqssufuziQRV\nomjNiI/c/TMz+yawP/Cyu9+ScGiSQmZW6+6NZtYLGAy85u6edFwikj5VOU+BmR0O3EJICAo1uXtd\nO4dUMjM7AbgG2AtoAMYSJoPaCrjJ3X+RYHgrNTNbHTgS+DpwAWHK7jfc/Z1EA2uGme0E3E2I+U3g\nJaAz0BU4wt3vSTC8VmXteufLcuzS/tJ0v1RrUvA+cBdwobs3JB1POczsv8Av3P1PZnYVsJ27b29m\nuwB/zl+FMm3MbF3gV8BAYBWWr6H5ehJxlcLMNgf+CXwAbEGoZToXOBjY192fSTC8osxsHDCGEOcZ\nwDGEuA8Hznb3PslF17IsXu+cLMeeE9WkbgK8DnTK2t/JLEnb/VKtfQrWBK7N6I3em/CHHmA/IDdN\n9IfAaolEVLpbgR0JtTQjgYsLvtLsSuB6d98WWAjg7kMJ03b/LsnAWtAfuNzd5wHfBe5z9y+Ap4H1\nkwysBFm83jmZjd3MVjWzm4DZhMXq1gFGmdmjZtYt2eiaZ2YDzOw5M1tgZosLv5KOrxWpul+qtU/B\nQ8CBwKVJB9IGbwJHmNnHwHrAA2a2CvAT4NVEI2vd9sDu7v5S0oG0wUDg+CLbbwBOaedYSjUd6Gtm\nXwEGENYegdD0NCWxqEqTxeudk+XYRwL9CPfL89G284DbCB9eQxKKqzXXAl8Qnq6z9rCXqvulapIC\nM7s172VH4HdmdiDwDrBMJhllaWn1E0I7cXfgd+7+hpldDXyPUHOQZlMI7dlZ9AlghPsl347AjPYP\npySXEWqSGoFn3P0ZMzuH8Ef+2EQja10Wr3dOlmM/EDjA3SeYGQDR9ycAjycaWcv6Azu4+8SkA2mD\nVN0vVZMUsGz7dQMwupl9qebuT5rZ14DV3X12tPkC4HR3/zLB0ErxG+AmM/sd8DYhs1/C3Z8v+q50\nuJgQ+28IzW57mNnRwDDgZ4lG1gx3v9LMniM0FTwWbX4SeMTd016rlLnrnSfLsa8GzCuyvZZ0f15M\nADYEspgUpOp+qcqOhgBm1gHo7u4fR68HEYb1LUw2suVFnQhLkubhlGbW2MLuVI/6ADCz/YAzgT6E\nP5AOXOrudyca2Eoqy9c7q7Gb2R+ArwBHAdMIHd8A/ghMdvcjkoqtJWZ2EnA+oZmj2APH6CJvS400\n3S9VmRSY2VbAw8Cf3P2saNvkaPe+7v56YsEV0cqHab5Uf7CaWYuxuXvaOwSlXnSvlPRLneZ7RZIR\nDY27ldAxtRaYA6xOqGk60t1nJRhes8zs3RZ2N7n7Ru0WTMaluTooTlcD97Fs1cwmwOWEDiu7JRBT\ns9x9ZRkl8hbwd+BR4MmoV3xmmNmeND+c8leJBLW83fO+H0jog/IrQk/yL4CtCX0Krmz/0FpmZiXP\nsZGi611URu6V5bj7Z8D3zWwj8p5a3f3NZCNrVR93X5B0EG2VpvulWmsK5gL93X1ywfaNgVfd/SvJ\nRFacma1X6rHuntpe5Wb2HWBPQu/3TQm9mx8FHnX3CUnG1hoz+z2hje9Vlu/d3OTue7R/VC0zszeB\nU939HwXbdwNuc/cNEwmsGWb2VImHpvJ652TtXlkZ/r6Y2XzgWcLfk79nIIlZIm33S7XWFEwhfDhN\nLti+E2EYV9q8R6gSbq5DZG5fE5DaKmF3fwR4BCDqLLknobfzb81surv3TjK+VvwAOMHdb231yPRY\nG/i4yPZ5QOrGnLv77q0flQlZu1feo/Ump7T/fdmKpQ8cPzezz4keOIAn3P3zJINrRarul2pNCn4N\n3BJ1LsyNmd+SMM3kyYlF1bxUPdGtiCgZ2IkwB/9gwnjoycBzScZVglVYOmlUVjwC3GpmpxKeQmoI\nVZRXEoa1poqZHVXioU3u/odYg1kxWbtXMv/3JVrLw4FrzayWcJ+fBvwFWAR0SjC81qTqfqnK5gOA\naCGhEwjjQ78E/gtc5e5p/3DKLDN7G9gAGA+8APwLeM7d0z52GzM7nzAv+fHuPjfhcEoSTVV7A2FC\nl1y/lC+BPwCnpG2kTSudxfKluuNYFu+V1phZR2CAu/876ViKieLblqUPHDsRHnqfJ/yN+W2C4bUo\nbfdL1SYFWRJN09nL3T9urXd5mnuUm9koYGfCWOjnCNnxc4ShoKWOsEhE1N69I+HDdQbLD3lK3YeU\nme1M6GDYkfBHB8JDVZqrUjMvi/dKjpntSOhs3Y/lp8Ff5O6pfOI2swWEJOAx4G+EB45X3T31H3Bp\nu1+qsvkgmhb4KJrv7Zm2GQ33AGblfZ/6G70Ydz8GwMzWBnYFdiEs0rOBmY1z972Ti65Vo6KvLLkf\n2MPdXyPUzmSKmX2VkMzkEt0aQjXwAHdP81oZo8jevZJzFaGPwQjgHsLfybUJcwCcmlhUrbuQ8MAx\nmLA+TF/gOTMb4+4fJhpZ60aRovulKpMC4CZCleqjZGCe7PxVstz96QRDqZQ5wMzo37mEJ9kuiUbU\nCne/HcDMuhCGr9YB76R8Ua1JhPUmXks6kHKZ2fGEocOrsGwn2yZgHCleQCuj90pOP8Ky2m+a2UvA\nQne/NlprZQRhddnUcfcLYclcKFsTHjgOAW6LOjGntt9E2u6Xak0KvgMc5u4PJx1IKaLqpVInpEnV\ncKd8ZvZrwjj6bYGpwD8Ii1I94e5zkoytNVHt0khCR9QOhA+pL83sTuBH0eqDaTMLuN7Mfkl4+ltm\nHHea7xXgHMK02BcB7xKSm9UI05Pfl2BcrcrovZIzj7BWBoTF17YkzC0yjtD/Ku2MUAO8A6FfwRxS\n3ok5bfdLtSYFC1l+8Yk0e7rItnOA61narJAFWwJ/Bo6Negtnye8JyeT+hM5LdYR2wCsJo1nOTC60\nZv0n+sqidYDb3X2hmb1MWOzmHjMbRphxL81LEGfxXsl5kjBE+FRC7MPN7EbCz5LaxN3M7ibUDqxB\n6E/wGPBrd8/C/Z+q+6Vak4ILgSuiG/9td1+UdEAtcfdfFm4zszOAKwonYEozd9/XzFYFDjez4wg3\n/5vAX/IWd0qrHwAHFzTf/C2aNOWPpPAPfbH7JkM+Br5KqOF4kzB09R5CDdM6yYVVkszdK3n+D7gD\n+D7hoeOHwKeElWRPSjCu1kwDhgJPZ22mVFJ2v1RrUjCC0HlmEkBuidCcNPfgzzIz60OoiuxAmB+i\nDjgMuMDMdkv5LGS1FJ8I6BNCtXbqRG2UJxDaiYt11uuTVGwluBsYHSWPjwJ/iNq49yMMH06zzN0r\nOe4+jdCZGVgy+2VfYI67T00qrta4+7CoA/PPor8zdYR5C25297eSja5VqbpfqjUpOCbpAKrU1YSp\nSI/LLfNsZp2Am4ErgG8mGFtr/glcbGZH5DoARYvH/BYodXre9nYzYYa3Jwgda+8iTC89EEh7LcII\nQnX1mu7+kJndQnhynQkcm2hkrcvUvVLiKqw9zGzjtK7CGg2//RthCeUXCEnBLsApZra3u/8ryfha\nkar7pSqTgvze/IXMrGd7xlJlBgFb5xICgKjN+NeE8fRpdjrhF3Sqmb1F6PhphNkY908ysBbsQ6iW\nfMLM+gGXuftLZnYJofYgzb6WvxCMu58LnJtgPOXI2r3ydMHr3GiPuYTJrtYgNB/MBr7WrpGV7hLg\nanf/af5GM7uI0P9kx0SiKk2q7peqTAostBdcTPFq1a+RsuvSTCZfC2xnZsusF5DWTD7yEWFK1cJm\ngo2BVE+o4+5Tow/WfYDNCD35HXg8xROkrEpYmRJCU9m2hGabGwg1Nmk2xcz+BfwJuNfdi1WvplLW\n7pX8VVjNbChwHPBDd38j2rYBcAuhGSetNgeOKLL9FkI/idRK2/2Sqg+/dnQTIRn4HWG55DOB9YEf\nE34h0ubpZrb/seB1mhcsgXDdbzGznxKGODURag9+TehRnmpRDcdD0VcWvEFoPrgVmEiY2OUGYHVC\nwpBmmxE6ux1H6BT8DKH5494MdErN4r2ScxGwVy4hAHD398zsNEIimdZRH+8B27F8f5PtSecid8tI\n0/1SrUnBQGCQu/8nWoTlDXe/Jqq6OQ64PdnwlpWfyWfcSOArwGWEKkkIPZsvi/alSjQXfymZepO7\nbxx3PG1wPnBPNKHLH4BJZvYwsAXpfurD3f9L+IC6KHpSPZAwu94VZvaUu++bZHyFVoJ7JaeJMLqj\ncMKrrwPz2z+cko0kzMmxGcs+cJxKGL6dKmm+X6o1KfiSpWNuc8OdniRMpvP7pIKqAj2Bn0dfvYAF\n7j4r+tDqR/pm3ju/hX1dgTMICzw93x7BlCvqoNcHqHX3D6LOWEcSxnFfmWx0ZVlA+ED6nDCxThpn\nvzy/hX2pv1fyXEMY6XEpy66seRpwXpKBtcTdR0WjyE4FfsLSKvjj3P2eJGNrxvkt7Ev0fqnKBZHM\n7FHC5EVnAEcDhwO7EZ5GrnF3dTaMQbSwU093/6Rg+8bABHdP4x/75ZjZ/oQP1a7AiLSsg17IzG4n\nDAH9h7vPTDqecpjZ+oTfx+8TqoDHE5oP7nL3j5KMrRxZuVfymdkJhPkJ+kabJhJWkL0zuahaFvW7\ner5wzplodNO33P3BZCIrTxrul2qtKRhOaLuZTBjmdBphZsCvABckGNdKJxpnPiJ6WQOMjZKDfN1Z\nvvNh6kQfVFcB3wZuI/zSpnlGyamEe/12M/sPocngUWBsGju8FXiX8KR6F3Cku7+XbDjlyeC9soS7\n3wjcmHQcZXqKUBP5ScH2foRZVDu3e0RlSNP9UpU1BQBmVgN0dvd5ZtaVUFMw093HJhvZyiWa13sI\nYbTEjYSqvfyFPpoIQ5+eSOvTrJl1IHRGPZfQm/9kd38h2ahKZ2bdCGtO7Al8g5CE/cPdD0s0sBaY\nmWVwKuzM3ysAZrYTMIwwp8V+hF7977n7nxMNrICZ/YiwzHNuCGVzH2ZPuHsq50BJ4/1SdUmBma0G\nLC42FWY0R8FIdz+q/SNb+UXDnUanfVrpfNGMbteydPnYK929saX3pI2ZfY2wOMzg6GsbwvTemyUa\nWCvM7LvAWUD+DHVXu/voRANrxkpyrxxIeFK9iTAaqx/wPcIIodPd/boEw1tO1GxQS+gT9n2WXQsm\n98AxIY2LUKX1fqmapCAazz+K8MQEoa11iLvPjjq6nU7oAPelu6+ZTJStM7MBhDangYRlZZeR5ima\nzexLQs/gPwH3uPuMhENqkZn9gTAv+XuETL7ZaV7TOD+Emd1GSAbWJ3Ti/Bdhxbjn0j7u38xOJExI\ncxXLLhJzEuHD6eYEw1tO1u+VHDN7lfBgdKeZfQ5s6e6TzewHwK/cfZOEQywqqn6fkoFmMSDd90s1\n9Sm4mtCbcwjwBXA2cJmZnUPoX7AVYaKL1A1fKXAtIf6DWbYaPgvWBQ4irHN+iZmNIbT33ZvS9tbc\nZCgbAi11skrr/BA7E2L/B2HVuDHAy+5e2Kcjjc4iVKXm1wo8YGaTCL+jqUoKyP69krMpYZrgQuNI\n90JU04ChZpZ7WKrJ3+nuQxOJqnmpvV+qKSnYGTjE3f8JYGavAC8TlvOtISzNOj7B+ErVnxDrxKQD\nKZe7TyckZ1ebWS9Cdd+BhAThOcJkTPe6+4IEw1wi6/NDuPsmUZPYroR54IcC65vZOEJtQZrXP1iL\n4h9OzwPrtXMsrcr6vZJnEmENklwzQe7J++hoX1rdRHhQepQMPCyl+X6ppqRgDeD13At3f8fMOhKq\nbw7Jn48/5SYQssvMJQUFukVfaxLuwy8JY4wvN7MfZmUIUdpFidhdZvY3QmJwAKG2bEfSvSjSK4TJ\nin5esP1o8n6PpeKGAw+b2R5AR8Kqg5sSpsjeL9HIWvYd4DB3fzjpQLKumpKCGsKiHvkWAednKCEA\nGA3cHLUXv01oSlgirZ2wAKL5vQ+OvjYlDCO6Brgvb3Ww8whVw0oKVpCZ7UPoQ7MboXnsv8DjhI5j\nTycWWGnOAv4ZfTiNJTyx7kj4Ob6TZGArM3d/LpoV8ORoUw9Cjc0Qd5+SXGStWkiYe0ZWUDUlBc1J\n9UI8RZwFzAMOLbKviZA0pNUEQvXvdcDdzXR2e5awQJKsuDsIy7LeADzm7h8mHE/J3P0FM9saOJ6l\ni8Q8DRzq7h8kGdvKLqpd+gWAmXUmLDb0WaJBte5CwhTYpxJG1mRmhFPaVNPog0bCaln57U3XE27+\nZT6c0vy0nWVm9hPCjHSZ+XDKMjOryUpv7JyoF/lw4KxoWe2JhNndICS9z7r7MUnFt7Izs76EBbSG\nE5ppXiAs4zsX2N/dn0owvGZFawmsTTMPumkelZU21VRTMIUwcU6+GYSxuPnS/rSNma1NiDs3fvtN\n4OZoEZk0Oxe4P+kgVmaFC61E88EX5e4btUdMpYo+kJ4n9HRfg/D7uT7wK0Li3hs438zuVdtxbK4h\nzPSaWxxuDcI6JUMJQ0S3Ti60Fh2TdAAri6pJCtx9g6RjqIRoUZu/E8adv0BICnYFTjWzvd39X0nG\n14q7gbPN7LeEMcVZGBqXNefnfb8xYWa664AXCf1PtgZOISwZnja/JPQvKRw+dq+7T4YlNQknAUoK\n4rE90M/dPzWzAwj/HzPM7I8s3+kzTYYSRh48ntaZUbOiapKClcglhMVJfpq/0cwuIqx1vmMiUZVm\nD8IH1XFAU9Sks4S7d0wkqpWIuy9Z9tvMxrP8KnEPRcNxf01oh02T3QjTMLfkJlK+7HPGzQF6mtki\nwtLDv4m2DyDU3KTVVMIEdKMyuM5HqigpyJ7NWTrxRb5bCH0m0uxHSQdQZTYjdO4sNJlQLZ82XYFP\nC7YdQJiYJucToFO7RVR9RhEmc1sIvAE8Hq0x8HtSXFPg7ucA5xSs8zEa6G5mqV7nI22UFGTPe8B2\nhOFl+bYHprd7NOX5LTA0ixMvZdRzhHkfjnP3qQBmthFh6uDHEo2suPeBLYAlowtyk43l2Ybl732p\nEHc/x8xeJCSNd7r7YjObQpgD4K8Jh1eKVQh9ahYQ1kHYkDCMVUpUlUmBmW3s7lkd0zoSuD4aSzyO\n8AswiDDxT9qnaF6X5eeKkPgMBe4FppjZLMJcHd0IwxRPSDKwZvyFMPX4s+6+3FBhM/sKcB4p7wic\nde5+fzRh0aBoXRh391RPGNXMOh8jycA6H2lTNUMS85nZdOA77v5S0rG0hZkdQ0gC+hAyYgcuLWg7\nTp2og+HhwO2Ep8JlpjN29z8mEdfKLpo0qk/0cqK7v5lkPM0xsy6E0QdrEvrOjCE87a1B6CszjFAb\ntqvGocfDzNYgrJK4P6F/QR2wGvAM8D13T+V8BWb2Ntld5yNVqjUp+A/wM3d/JOlYyhUtFfp84R9F\nM+sEfCvN0wObWUuTzjS5e+rmtM8aM1sP+KClzlXRvfL9NCZhZtaVUBtwNPBVQk1YDTCTMH7+fHef\nn1yEKzczG01III9w97eibX0JfQ0muPtxCYbXooJ1PnYh1BpkYZ2PVKnWpOA24EjCMK33WP6JNW0r\nai1hZouBnu7+ScH2rYF/uXvnZCKTNIjuj175VaZm9gjwQ3f/KHq9FjAtzRO6mFkNYaTKmsBswix1\neuqLmZnNAfYqXBzOzLYD/u7uPZKJrHRmthrLrvPR6O5dko0qO6qyT0Hkjrzva5o9KgWi3r/XsvSp\naXozk9I80Z5xtYWZ9QA2YelyoDWE3uQD3P2SxAJbeRS7l3cBMpUsRjUdb0df0n4WkDf5VZ5GUrzk\nczPrfPyDbKzzkSpVmRS4+7FJx1AOd7/ezF4HaoEngYMIba05TYRpSIsNP0sNMzuOMGNaR5YmOETf\nv0RoRxaR5DwEXGNmR+Q6Y0edDq8G/pZoZC3L7DofaVOVSQGAme1E6Li0KWFJ0COA99z9z4kG1gx3\nfxaWVAVPzMCUxsX8jDDB0kWEJ8BBQD2hvTKV112kypwFPAC8FTUlNAHdCbOonpJkYK1Y092bogRm\nazMbCLzp7m8kHVjW1CYdQBLM7EBC1vs+YbGPVYAvCbNhnZRkbCXYiRBrFq0D3Oruc4GXgYHu/hpw\nGnBiopGJVLmoLf4Ld9+NMIPhSYRhrX2AH5LOqbFz6s3sfsI6MLdFXxPN7EkzWz3Z0LKlWmsKzgNO\ndvc7zexEAHe/xMw+Iiy+cl2i0bXsUuBaM7uM4sP60rzm+SeE9dnfJfzybgXcQ5ispneCca1sBpnZ\n7LzXtcB2Zpa7xt0TiElSKrovRhHa5DGzvwND3P21aJ6C0wmzGab5YeQqwt+QPkVGTVxKmFpdSlCt\nScGmhMWECo0jPM2m2a+if78V/ZvrFFQTfZ/azkCEyWluj/oWPBp9P47QfKMOZZVTbCXKwuGH1Tfs\nSJpzNbABoaf+F8DZhEmkziH0MdiKMI16midH258wauKt3AZ3f93MTiE0fSgpKFG1JgWTgG+ytEYg\n9wfy6Ghfmm2YdADlKJhX4UzCE0dPd38gGhM9ijAG/ejkolx5uHtVNgnKCtkZOCQ3pXS0YNbLwJaE\nh40dCocoplAmR02kUbXOU7AzYenVfxAyzD8Qag+2BfZz9ycTDK9NzKwjYVjfv5OOJV+xcfMikh7R\n72jv3DwW0bb5hNq8Q9w9zc0GAJjZjYR1MwpHTYwGJrt7sUXkpIiqrClw9+eitQNOjjb1IDQnDEl5\nmzxmtiNhzoJ+LN9RdBHpW0Eu1XNAiAg1LL8mySLC7JGpTwgiLY2aODXJwLKmKpMCAHefDvwi6Tja\n4CrCLIwjCJ30jgLWBs4nvTd/9VVHiWTfcotSpVh3wvLOTxL+Pq5OmK/grZbeJMuryqQgWvTjJ8BA\nwnDEZZ5m3X2PJOIqUT9CFdmbZvYSsNDdrzWzjwmJwl3JhlfU+KiKskXuvlF7BCMiyznEzBryXtcB\nB0Z/V5Zw91StUGlmewCXAZuz7N/xJuAlMxvu7mMSCS6jqjIpIHRu2wG4E2ho+dDUmUfoPANhWN+W\nhCqycYQ5F9LoEiCVq6uJCFMID0n5ZgA/LtjWRIqWrTazbwCPAH8ixPo64e9MPeHv4lDgCTPb3d2L\njTaTIqq1o+EcQofC55KOpVxm9hdCRnwqsCcwPPr3B8BZaVtpUB0N08fMugH3prxGTKRFZjaGsAjc\niBaOuRzY1N2/036RZVu1Dl/6lPDEnUX/B3QDvk+YGriB8PNcxtI5DNJEHQ3TZzFh4iuRLNsSuL2V\nY24Gtm6HWFYa1dp8cCZwnZn9gjBpzhf5O9M8AsHdpwFLnvDMbDegLzDH3acmFVcLbgfmJx2ELOXu\nDUCmFgUTKaILyy4MV8ynwNfaIZaVRrUmBfdG//6NZXvGZ2FWwCXMbE3gEEK8DyYcTlFZW5FyZWJm\nk4Ft3X1Wwfa1gf+4u/5YSpbVsLR/VXOqr318BVVrUpC1WQG7EFYXPDTa9AfC0MR/AV0JzUAXm9m3\ncqspSnUys4OAb0cvNyAsg1tYU7MBYRy6SNYVjpoopMWQylSVSYG7Z6099XJgO0KzxyeEfgVjgccI\nPWybgGuAXxItaiJV6xlCUpDry1HD8kO1JhHmtxfJsmKjJpo7TkpUNaMP8nvBm1kjLVQruXuqmg/M\nbAZhtMS46PWawMfAoNy0xtGUni+7+2rJRSppYmbnAb+PlqoWEWlVNdUU7MHSTilZe5r+KmF5YQDc\n/VMzm0foRJPTQOh4I//f3v3HbFXWcRx/gy5qShHZtJJMND9ikEH2A0Uyy+HSGmmuhFSsjUWUtpaW\nYV0RhwsAAAe8SURBVAkGA4m5hNZkYyKwMG3C1FZJ5cLQQVZOiMHXhHTTnLR6RFcJKE9/fK+bDjc3\nNz+m3Tecz2t7xn3OdZ7rup6HsfPlOt/rfA1JxwIzSiEqJA0n/w1sAZY5UDCzVmoTFETEyubPkvoD\nJ5MvvehXsrK7VfMbAXtxEo01kXQ0WSb5AvLtlxslTSC3Zj1DbsWdJml0RDzdsYmaWVeqTVBQJakf\nWUO8kRl/CjCnJPRdGhE9HZvc3o2UVJ1XX+CDko4vxwM7MCfrPtPIRNrRQEg6CrgFWAOcExE7JN0K\nzAI+37lpmlk3qmVQQGbyvwcYDjxczt0ALATmApd1aF7tLG9xbmnTsVcO7GLgyoh4CEDSGKA/MK9S\n8e428vWwZma7qWtQcBEwNiLWSVkuoHyeCKzo6MxaiIi6vnnSDtxxwKbK8cfJR0/3V849R25lNTPb\nTV1vNv1p/ZrjvtQ3ULLDwzPAYABJfcjcgtVNj8TOxNu0zKyFugYF9wIzSqIhQK+kE8kXAnlZ1Q5l\nS4BbJH2KrIcxCPhRo1HS6cBM4KedmZ6ZdbO6BgVfIV+P2UMuo/6RrIHQQ74YyOxQNR34DZkfMx74\nbkTcASBpDvAosBaY0bEZmlnXqs3Li1qRdBJwKvnIICJiY4enZPaakTQMODIiHu30XMysO9UyKHCh\nGDMzsz3VJqnOhWLMzMzaq1NOQeONhs2FYqoFY9YDY//P8zIzM+sKdX184EIxZmZmTWoXFJRCMf9w\noRgzM7Pd1SYoaC4UExGtCsX0A1woxszMaqlOOQXtCsWcHBFDyFccz+rcFM3MzDqnNrsPcKEYMzOz\ntuq0UuBCMWZmZm3UKShwoRgzM7M26hQUuFCMmZlZG3XKKZgOvJEsFLOTPQvFfB34GS4UY2ZmNVWb\nLYntuFCMmZmZgwIzMzMr6pRTYGZmZm04KDAzMzPAQYGZmZkVDgrMzMwMcFBgZmZmhYMCs8OUpJ2S\nLt/Pa08o149uc81CSQ+8ejPc1e9USX99tfvdz7H3+3dkVgd1enmRWd0cB2w9gOs7tT+5t4Njm1mF\ngwKzw1REbDnAb+nzmkzEzA4ZDgrMupCkncAXgXHAWWRBr0URMb1yzYXAVOC00n4HMD0itlf6mBAR\ni8vx14CrgGOBVeXrCxFxYmXokZJmA+8rfX4vIm6vtB8paS5wBbCNLDd+fUS8XMY4HpgFfIwsTb4K\nuCYi1pX2hWQl0jcBHyJfP974ea4Fvgq8BVgNTIyIJ0rbm8u1nwSOAf4ETImIlZXvvwC4HhgKvFh+\nH1Mi4qXS/g6y3slHgeeBb7b/WzCrH+cUmHWvOeRN973AXcCNkkYBSDofuBO4lQwKJgGXAItbdSRp\nMnlTnQacDvwWuIE9l+2vBm4EhgC/BBZIGlxpHwW8FfgwMIEMDr5fxjgaeBh4O3AhMBL4N/CgpEGV\nPi4mS5afQd64Ad5FVik9HzgbeBuwoPTbF/gVGRyNA0YA64AVkt5frhkL3APcCwwHJgKfBZaW9iPK\nmANL/5cA17T4+c1qzSsFZt3r9kbRLmCKpEnkjXEV8G1gfkQsKO1PlvYHJF0bEc0lwL8B/CAiFpXj\nmZLOIG+gVVMj4ucAkqaQwcYIYHNp/xtwRVmN2CDpO8A8SdcBl5E33c9ExD9LH+OATcBk4Fulj56I\nuLkxoCSA7cD4iPhXOTef/60ijCnzHBoRG8q5SZI+QN7YP1f6vjsiZpb2JyR9GVgu6VTgBDLQOSki\nnixjXAm43olZhVcKzLrXxqbjrcDryucR5I3xxcYXWeVzJ3nz20XSQPKmuLqpvwdbjPmXxoeIeL58\nfEOl/Q+NxxPFmjKnU8hl+8cbAUHp4yXg98CwVmNUPNcICIqeyrhDga2VgKDhd5V+hwEPNbWvJPMk\nhpU+ehoBQZnbY+RKhpkVXikw617bWpxrJAP2BWYDi1pc82zT8cuV79mXV9qM2ar9iPLntnJdq+X4\nvsCOyvF/9nPc6vj76rfVNY2ft3pNsx0tzpnVllcKzA5NfwYUEZsbX8A7yTyE/tULI+IF4CkyD6Dq\nzIMYt/lxw9nkTX4zsBaQpGMajZJeT+YOrD+IsRrWAgMkndZ0flSl37VlLlWjyUBhA/mYYICkXaso\nkt5NJjyaWeGVArND003AneWZ/k/IgGABsGkvWxFnAXMkbSSX2T9NJvw9dYDjDpJ0Gxl8DCF3P9wU\nETskLQWuA+4qOwm2k8mMRwHzD3CcqhXAY8BSSVcBW8hdCkOBL5VrZpdxp5BJmQLmAfdFREh6nHyM\nsaQkXb4CzKX9CoVZ7XilwKw7tVou33UuIu4ms+vHkv9LXgz8ArhoL9fPB2aQyXvrgHOBheSNe19j\nVs/fQz6OWAP8sHxNL2O8AHyEzAf4NZmz0A84q0Xi436LiJ3AeeT/9pcBj5A7Ls6NiEfKNcuAS8ld\nBWvJrYc/Jn9HREQv8AkyT+N+4D5y58PfD3ZeZoejPr293pFjdriTNAZYHxFPV87NBwZHxHmdm5mZ\ndRM/PjCrh8uBIWXb4rPAOcB4csuhmRngoMCsLiYDNwPLgQHkuwOujoglHZ2VmXUVPz4wMzMzwImG\nZmZmVjgoMDMzM8BBgZmZmRUOCszMzAxwUGBmZmaFgwIzMzMDHBSYmZlZ4aDAzMzMAPgv5QkMHLW1\nVSoAAAAASUVORK5CYII=\n",
      "text/plain": [
       "<matplotlib.figure.Figure at 0x11a0c3278>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "avg_zips.plot.bar(x=\"neighborhood\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": false
   },
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## NLP\n",
    "\n",
    "We have review text (\"comments\") for each review. We can apply NLP techniques such as keyword extraction and sentiment analysis to enhance our data model. We will use the [Textblob Python toolkit](https://textblob.readthedocs.io/en/dev/)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 67,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "# pip install textblob\n",
    "from textblob import TextBlob"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 65,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "'I had a great time staying here! The room is huge and sunny, and it was the perfect place to do some work and hang out in the afternoon before heading out to dinner. Alexandra and David were very welcoming hosts. They were always around to answer any questions. They had breakfast and coffee for me every morning and even left it on the table by the door on mornings when I had to rush out to the office.  The cats were really cute too!'"
      ]
     },
     "execution_count": 65,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# fetch one review\n",
    "review = graph.run(\"MATCH (r:Review) RETURN r.comments LIMIT 1\").evaluate()\n",
    "review"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 72,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Sentiment: \n",
      "0.5375000000000001\n",
      "\n",
      "Keywords: \n",
      "['great time', 'perfect place', 'alexandra', 'david']\n"
     ]
    }
   ],
   "source": [
    "# instantiate TextBlob object\n",
    "blob = TextBlob(review)\n",
    "\n",
    "# sentiment analysis\n",
    "print (\"Sentiment: \")\n",
    "print(blob.sentiment.polarity)\n",
    "print()\n",
    "\n",
    "# keyword extraction (using noun phrases)\n",
    "print (\"Keywords: \")\n",
    "print(blob.noun_phrases)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "\n",
    "## Keyword extraction\n",
    "\n",
    "We can extend the model to include keywords extracted from the reviews:\n",
    "\n",
    "![](http://guides.neo4j.com/listings/img/datamodel_keyword.png)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 74,
   "metadata": {
    "collapsed": false
   },
   "outputs": [],
   "source": [
    "graph.run(\"CREATE CONSTRAINT ON (k:Keyword) ASSERT k.name IS UNIQUE;\").evaluate()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 97,
   "metadata": {
    "collapsed": false
   },
   "outputs": [],
   "source": [
    "# extract keywords and write back to graph\n",
    "reviews = graph.run(\"MATCH (r:Review)-[:REVIEWS]->(l:Listing) RETURN r.comments AS review, l.listing_id AS id LIMIT 100\")\n",
    "tx = graph.begin()\n",
    "for r in reviews:\n",
    "    blob = TextBlob(r.get(\"review\"))\n",
    "    keywords = blob.noun_phrases\n",
    "    review_id = r.get(\"id\")\n",
    "    tx.run('''\n",
    "        MATCH (l:Listing) WHERE l.listing_id = {listing_id}\n",
    "        UNWIND {keywords} AS kw\n",
    "        MERGE (k:Keyword {name: kw})\n",
    "        MERGE (l)-[:CONTAINS]->(k)\n",
    "    ''', parameters={\"listing_id\":review_id, \"keywords\":keywords})\n",
    "tx.commit()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": 98,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      " k.name             num \n",
      "------------------------\n",
      " austin             6   \n",
      " great experience   5   \n",
      " lovely home        4   \n",
      " thank              4   \n",
      " airbnb             4   \n",
      " perfect            3   \n",
      " highly             3   \n",
      " 's place           3   \n",
      " great time         3   \n",
      " excellent          3   \n",
      " thanks             3   \n",
      " great host         3   \n",
      " private bathroom   2   \n",
      " cable tv           2   \n",
      " amazing place      2   \n",
      " wonderful hosts    2   \n",
      " late arrival       2   \n",
      " safe neighborhood  2   \n",
      " clean              2   \n",
      " friendly dog       2   \n",
      " communication      2   \n",
      " host               2   \n",
      " hosts              2   \n",
      " studio apartment   2   \n",
      " carol              2   \n"
     ]
    }
   ],
   "source": [
    "# What is the most common Keyword?\n",
    "graph.run(\"MATCH (l:Listing)-[:CONTAINS]->(k:Keyword) RETURN k.name, COUNT(*) AS num ORDER BY num DESC LIMIT 25\").dump()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Community Detection\n",
    "\n",
    "Community detection (or clustering) can be used to enhance our data model, by identifying similar listings based on extracted keywords.\n",
    "![](http://www.lyonwj.com/public/img/community-1.png)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 86,
   "metadata": {
    "collapsed": false
   },
   "outputs": [],
   "source": [
    "# pip3 install python-igraph\n",
    "from igraph import Graph as IGraph"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Find all pairs of topics and find the number of common groups that share each pair of topics. We'll use this as weight to build a \"virtual graph\" of the form(Topic)-[:OCCURS_WITH {weight}]-(Topic)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 99,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "('k.name': 'austin', 'other.name': 'airbnb', 'weight': 4)\n",
      "('k.name': 'austin', 'other.name': 'thank', 'weight': 4)\n",
      "('k.name': 'austin', 'other.name': 'lovely home', 'weight': 4)\n",
      "('k.name': 'thank', 'other.name': 'great experience', 'weight': 3)\n",
      "('k.name': 'thank', 'other.name': 'airbnb', 'weight': 3)\n",
      "('k.name': 'thank', 'other.name': 'lovely home', 'weight': 3)\n",
      "('k.name': 'austin', 'other.name': 'great experience', 'weight': 3)\n",
      "('k.name': 'lovely home', 'other.name': 'airbnb', 'weight': 3)\n",
      "('k.name': 'thanks', 'other.name': 'great experience', 'weight': 3)\n",
      "('k.name': 'excellent', 'other.name': 'highly', 'weight': 3)\n",
      "('k.name': 'great experience', 'other.name': 'perfect', 'weight': 3)\n",
      "('k.name': \"'s place\", 'other.name': 'clean', 'weight': 2)\n",
      "('k.name': 'thank', 'other.name': 'great time', 'weight': 2)\n",
      "('k.name': 'wonderful hosts', 'other.name': 'great experience', 'weight': 2)\n",
      "('k.name': 'great experience', 'other.name': 'studio apartment', 'weight': 2)\n",
      "('k.name': 'thanks', 'other.name': 'perfect', 'weight': 2)\n",
      "('k.name': \"'s place\", 'other.name': 'communication', 'weight': 2)\n",
      "('k.name': 'austin', 'other.name': 'highly', 'weight': 2)\n",
      "('k.name': 'great time', 'other.name': 'thanks', 'weight': 2)\n",
      "('k.name': 'airbnb', 'other.name': 'highly', 'weight': 2)\n",
      "('k.name': 'great experience', 'other.name': 'excellent', 'weight': 2)\n",
      "('k.name': 'austin', 'other.name': 'great host', 'weight': 2)\n",
      "('k.name': 'thank', 'other.name': 'thanks', 'weight': 2)\n",
      "('k.name': 'studio apartment', 'other.name': 'excellent', 'weight': 2)\n",
      "('k.name': 'great time', 'other.name': 'great experience', 'weight': 2)\n"
     ]
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (k:Keyword)<-[:CONTAINS]-(:Listing)-[:CONTAINS]->(other:Keyword)\n",
    "WHERE ID(k) < ID(other)\n",
    "RETURN k.name, other.name, COUNT(*) AS weight\n",
    "ORDER BY weight DESC\n",
    "LIMIT 25\n",
    "\"\"\"\n",
    "\n",
    "result = graph.run(query)\n",
    "for row in result:\n",
    "    print(row)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 100,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<igraph.Graph at 0x118431c78>"
      ]
     },
     "execution_count": 100,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (k:Keyword)<-[:CONTAINS]-(:Listing)-[:CONTAINS]->(other:Keyword)\n",
    "WHERE ID(k) < ID(other)\n",
    "RETURN k.name, other.name, COUNT(*) AS weight\n",
    "\"\"\"\n",
    "\n",
    "ig = IGraph.TupleList(graph.run(query), weights=True)\n",
    "ig"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Now we'll run the Walktrap community detection algorithm to find clusters / communities:\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 101,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "10"
      ]
     },
     "execution_count": 101,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "clusters = IGraph.community_walktrap(ig, weights=\"weight\")\n",
    "clusters = clusters.as_clustering()\n",
    "len(clusters)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 102,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'group': 0,\n",
       "  'id': 'geen uitgebreid openbaar vervoer heeft',\n",
       "  'label': 'geen uitgebreid openbaar vervoer heeft'},\n",
       " {'group': 0, 'id': 'bat fest', 'label': 'bat fest'},\n",
       " {'group': 1, 'id': 'great host', 'label': 'great host'},\n",
       " {'group': 2, 'id': 'church building', 'label': 'church building'},\n",
       " {'group': 0, 'id': 'own private bathroom', 'label': 'own private bathroom'}]"
      ]
     },
     "execution_count": 102,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "nodes = [node[\"name\"] for node in ig.vs]\n",
    "nodes = [{\"id\": x, \"label\": x} for x in nodes]\n",
    "nodes[:5]\n",
    "\n",
    "for node in nodes:\n",
    "    idx = ig.vs.find(name=node[\"id\"]).index\n",
    "    node[\"group\"] = clusters.membership[idx]\n",
    "    \n",
    "nodes[:5]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "query = \"\"\"\n",
    "UNWIND {params} AS p \n",
    "MATCH (t:Keyword {name: p.id}) \n",
    "MERGE (cluster:Cluster {name: p.group})\n",
    "MERGE (t)-[:IN_CLUSTER]->(cluster)\n",
    "\"\"\"\n",
    "\n",
    "graph.run(query, params = nodes)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Sentiment Analysis"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 114,
   "metadata": {
    "collapsed": false
   },
   "outputs": [],
   "source": [
    "# compute sentiment and write back to the graph\n",
    "reviews = graph.run(\"MATCH (r:Review) RETURN r.comments AS review, r.review_id AS id LIMIT 100\")\n",
    "tx = graph.begin()\n",
    "for r in reviews:\n",
    "    blob = TextBlob(r.get(\"review\"))\n",
    "    sentiment = blob.sentiment.polarity\n",
    "    review_id = r.get(\"id\")\n",
    "    tx.run('''\n",
    "        MATCH (r:Review) WHERE r.review_id = {review_id}\n",
    "        SET r.rating = {sentiment}\n",
    "    ''', parameters={\"review_id\":review_id, \"sentiment\":sentiment})\n",
    "tx.commit()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 117,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'r': (ca71fb6:Review {comments:\"My husband and I did not actually meet Natalie in person, but we did maintain contact through texts. The photos represented her place very well. The proximity of her house was so convenient for everything we did in Austin.\",date:\"2015-07-26\",rating:0.1,review_id:\"39883571\"})},\n",
       " {'r': (f75a98c:Review {comments:\"Very nice host. House is in a great location on a cul-de-sac on a quiet street. The area you'll stay is in a converted storage shed that has a bunch of beds and a small bathroom with a shower. It's comfortable enough for a crash pad, but a little cramped otherwise. The house had essentially no kitchen utensils when I stayed, although the listing said it was fully furnished. Apparently Nick's roommate moved out a few days before we came and took it all with him. The house has a fraternity house feel with a bunch of beer cans, cups, and other party materials scattered about. It left a bit to be desired in that aspect. Overall, it's fine for a place to sleep a bunch of people, but I wouldn't want to hang out at the house.\",date:\"2015-07-18\",rating:0.12029761904761906,review_id:\"38775887\"})},\n",
       " {'r': (acea79c:Review {comments:\"Monica was a lovely host. Her cute little free-standing, private cottage was just what we wanted.  It was quiet,  in a nice neighborhood and had all the essentials: comfortable queen-sized bed, real blanket and comforter (becoming scarcer and scarcer in hotels, but I appreciate them!), \\\"dorm sized\\\" fridge with a little freezer, hot water kettle for making tea, coffee, instant oatmeal, etc.  The bathroom was very small, but clean, and functional. The garden was lovely and she has a hot tub which guests can use, but we didn't use either--we were out early and in late every day.  The internet worked great--until AT&T itself went down.  Monica then spent an hour on the phone with them to get them back up, as we had a couple of urgent emails to end.  (Thanks, Monica!)\\r\\n\\r\\nWe had a bit of trouble reaching Monica by email initially, but we did finally succeed and then found that if contacted by text, she responds within seconds!  We had a great stay!\",date:\"2015-04-14\",rating:0.1547542735042735,review_id:\"29930258\"})},\n",
       " {'r': (dd6d8c9:Review {comments:\"Monica and Greg are the hosts with the mosts!!!! They are Austinites through and through with great recommendations on where to eat, music venues, festivals, and hot spots not to be missed. Their warmth is the first thing you feel when entering this hidden gem in Hyde Park.\\r\\n\\r\\nOur private cottage was nestled in the trees and was appointed with lovely ammenities.  We had fluffy white towels, a fridge stocked with beer and Topochico, as well as snacks for when we were on the go! I will definately stay here again and would higly recommend it to future guests!\",date:\"2015-04-28\",rating:0.15925925925925927,review_id:\"30877089\"})},\n",
       " {'r': (cf568ac:Review {comments:\"Great little cottage behind the main house. Monica was quick to respond, accommodating with check-in and check-out, and all around set the cottage up to be very guest-ready (super clean, tea and snacks provided, as well as bathroom amenities!) The bus downtown was also conveniently located just a block or so away, as were some local eats like a vegan food trailer park! Only thing to note was that during my stay the internet was a bit weak/spotty (not an issue for me, but if you needed to get some work done may need to ensure there would be a stable). connection)\",date:\"2014-03-12\",rating:0.17041666666666666,review_id:\"10901651\"})}]"
      ]
     },
     "execution_count": 117,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "graph.run(\"MATCH (r:Review) RETURN r ORDER BY r.rating ASC LIMIT 5\").da"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Recommendations"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Concept Graph"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.6.0"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
